### Project Name: Olympics Analysis

- Sports goes into entertainment category as far as viewers are concerned.Olympic athletes are considered as benchmarks in regards with their Strength, Agility and Intelligence.
- Goal is to explore a dataset on the modern summer Olympic Games, from Athens 1896 to Rio 2016 and try to know the results of Olympics,understands the trends of Olympics games results and answer some common questions about the summer olympics dataset taken from Kaggle.
- Basically dataset have records which corresponds to an individual athlete competing in an individual Olympic event such as name,age,medal_won and so on.

Using summer olympics dataset we try to find out following questions answer:

### Phase 1: Data Collection

 ##### We are using two tables which are residing in MySQL database:
 - olympics_history table where each row corresponds to an individual athlete competing in an individual Olympic event.
 - olympics_history_noc_regions contains NOC(National Olympic Committee  a 3-letter code) which helps us to add country information and its correspondion region from its NOC code.

In [95]:
# importing Basic libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

### Phase 2: Data Understanding

In [96]:
import mysql.connector

mydb=mysql.connector.connect(
host="localhost",
user="root",
password="Sangeeta@4820",
use_pure=True)

In [97]:
query = '''SELECT * FROM Olympics.olympics_history'''

In [98]:
olympics_history_df = pd.read_sql_query(query, mydb)

#### Fix dataframe column names:

In [90]:
olympics_history_df.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [94]:
olympics_history_df = olympics_history_df.rename(columns={'ID':'id', 
                         'Name': 'name', 
                         'Sex':'sex',
                         'Age':'age',
                         'Height':'height',
                         'Weight':'weight',
                         'Team':'team',
                         'NOC':'noc',
                         'Games':'games',
                         'Year':'year',
                         'Season':'season',
                         'City':'city',
                         'Sport':'sport',
                         'Event':'event',
                         'Medal':'medal'})

In [99]:
olympics_history_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24,180,80,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NA
1,2,A Lamusi,M,23,170,60,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NA
2,3,Gunnar Nielsen Aaby,M,24,NA,NA,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NA
3,4,Edgar Lindenau Aabye,M,34,NA,NA,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21,185,82,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NA

In [80]:
df.iloc[df['Year'].argmin()].reset_index()

     index                         21994
0       ID                         12068
1     Name          Arthur Charles Blake
2      Sex                             M
3      Age                            24
4   Height                            NA
5   Weight                            NA
6     Team                 United States
7      NOC                           USA
8    Games                   1896 Summer
9     Year                          1896
10  Season                        Summer
11    City                        Athina
12   Sport                     Athletics
13   Event  Athletics Men's 1,500 metres
14   Medal                        Silver

In [81]:
df.iloc[df['Year'].argmax()].reset_index()

     index                                       80
0       ID                                       22
1     Name                            Andreea Aanei
2      Sex                                        F
3      Age                                       22
4   Height                                      170
5   Weight                                      125
6     Team                                  Romania
7      NOC                                      ROU
8    Games                              2016 Summer
9     Year                                     2016
10  Season                                   Summer
11    City                           Rio de Janeiro
12   Sport                            Weightlifting
13   Event  Weightlifting Women's Super-Heavyweight
14   Medal                                       NA

In [76]:
nan_data= df.replace('NA', np.nan)

In [77]:
nan_data.isnull().sum()

ID             0
Name           0
Sex            0
Age            0
Height     51402
Weight     54074
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     222153
dtype: int64

In [63]:
query2 ='''SELECT * FROM Olympics.olympics_history_noc_regions'''

In [64]:
df = pd.read_sql_query(query2, mydb)

In [65]:
df.head()

   NOC       region                 notes
0  AFG  Afghanistan
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [67]:
df.isnull().sum()

NOC       0
region    0
notes     0
dtype: int64

In [69]:
df

     NOC       region                 notes
0    AFG  Afghanistan
1    AHO      Curacao  Netherlands Antilles
2    ALB      Albania
3    ALG      Algeria
4    AND      Andorra
..   ...          ...                   ...
225  YEM        Yemen
226  YMD        Yemen           South Yemen
227  YUG       Serbia            Yugoslavia
228  ZAM       Zambia
229  ZIM     Zimbabwe

[230 rows x 3 columns]